In [1]:
#Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [3]:
data= [4,8,15,16,23,42]

In [4]:
import pandas as pd

In [5]:
pd.Series(data)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [6]:
#Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [6]:
var= [1,2,3,4,5,6,7,8,9,10]

In [7]:
Variable=pd.Series(var)

In [8]:
print(Variable)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [11]:
#Q3. Create a Pandas DataFrame that contains the following data:

In [9]:
d= {"Name" :['Alice','Bob','Claire'], "Age" : [25,30,27], "Gender": ["Female", "Male", "Female"]}

In [10]:
pd.DataFrame(data= d)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [14]:
#Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In [15]:
"""Series is a one-dimensional labeled data structure, similar to a column in a spreadsheet, while a 
DataFrame is a two-dimensional labeled data structure, resembling a table or a spreadsheet. The Series is typically used
to represent a single column or variable, while the DataFrame provides a tabular structure for working with multiple 
columns and performing various data manipulation and analysis tasks on structured data."""

'Series is a one-dimensional labeled data structure, similar to a column in a spreadsheet, while a \nDataFrame is a two-dimensional labeled data structure, resembling a table or a spreadsheet. The Series is typically used\nto represent a single column or variable, while the DataFrame provides a tabular structure for working with multiple \ncolumns and performing various data manipulation and analysis tasks on structured data.'

In [11]:
data= [4,8,15,16,23,42]
pd.Series(data)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [17]:
# Single dimesional output

In [12]:
d= {"Name" :['Alice','Bob','Claire'], "Age" : [25,30,27], "Gender": ["Female", "Male", "Female"]}
df= pd.DataFrame(data=d)

In [13]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [20]:
# two-dimesional output

In [21]:
#Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
#you give an example of when you might use one of these functions?

In [1]:
#Some commonly used functions and methods for data manipulation in Pandas:

In [16]:
df=pd.read_csv("services.csv")  # for reading csv files.

In [18]:
df.head(3)  # for looking into top data

,id,location_id,program_id,accepted_payments,alternate_name,application_process,audience,description,eligibility,email,...,interpretation_services,keywords,languages,name,required_documents,service_areas,status,wait_time,website,taxonomy_ids
0,1,1,NaN,NaN,NaN,Walk in or apply by phone.,"Older adults age 55 or over, ethnic minorities...",A walk-in center for older adults that provide...,"Age 55 or over for most programs, age 60 or ov...",NaN,...,NaN,"ADULT PROTECTION AND CARE SERVICES, Meal Sites...",NaN,Fair Oaks Adult Activity Center,NaN,Colma,active,No wait.,NaN,NaN
1,2,2,NaN,NaN,NaN,Apply by phone for an appointment.,Residents of San Mateo County age 55 or over,Provides training and job placement to eligibl...,"Age 55 or over, county resident and willing an...",NaN,...,NaN,"EMPLOYMENT/TRAINING SERVICES, Job Development,...",NaN,Second Career Employment Program,NaN,San Mateo County,active,Varies.,NaN,NaN
2,3,3,NaN,NaN,NaN,Phone for information (403-4300 Ext. 4322).,Older adults age 55 or over who can benefit fr...,Offers supportive counseling services to San M...,Resident of San Mateo County age 55 or over,NaN,...,NaN,"Geriatric Counseling, Older Adults, Gay, Lesbi...",NaN,Senior Peer Counseling,NaN,San Mateo County,active,Varies.,NaN,NaN

In [20]:
df.tail()  # for looking the bottom data

,id,location_id,program_id,accepted_payments,alternate_name,application_process,audience,description,eligibility,email,...,interpretation_services,keywords,languages,name,required_documents,service_areas,status,wait_time,website,taxonomy_ids
18,19,19,NaN,NaN,NaN,Call for screening appointment (650-347-3648).,NaN,Provides free medical and dental care to those...,Low-income person without access to health care,NaN,...,NaN,"HEALTH SERVICES, Outpatient Care, Community Cl...",NaN,San Mateo Free Medical Clinic,NaN,"Belmont, Burlingame",active,Varies.,NaN,NaN
19,20,20,NaN,NaN,NaN,Walk in.,NaN,no unrequired fields for this service,NaN,NaN,...,NaN,NaN,NaN,Service with blank fields,NaN,NaN,defunct,NaN,NaN,NaN
20,21,21,NaN,NaN,NaN,By phone during business hours.,NaN,just a test service,NaN,NaN,...,NaN,NaN,NaN,Service for Admin Test Location,NaN,San Mateo County,inactive,NaN,NaN,NaN
21,22,22,NaN,"Cash, Check, Credit Card",Fotos para pasaportes,Walk in or apply by phone or mail,"Profit and nonprofit businesses, the public, m...",[NOTE THIS IS NOT A REAL SERVICE--THIS IS FOR ...,None,passports@example.org,...,We offer 3-way interpretation services over th...,"Salud, Medicina",Spanish,Passport Photos,Government-issued picture identification,"Alameda County, San Mateo County",active,No wait to 2 weeks.,http://www.example.com,"105, 108, 108-05, 108-05-01, 111, 111-05"
22,23,22,NaN,NaN,NaN,Walk in or apply by phone or mail,"Second service and nonprofit businesses, the p...",[NOTE THIS IS NOT A REAL ORGANIZATION--THIS IS...,None,NaN,...,NaN,"Ruby on Rails/Postgres/Redis, testing, wic",NaN,Example Service Name,NaN,"San Mateo County, Alameda County",active,No wait to 2 weeks,http://www.example.com,NaN

In [23]:
df.columns  # for checking names of columns present

Index(['id', 'location_id', 'program_id', 'accepted_payments',
       'alternate_name', 'application_process', 'audience', 'description',
       'eligibility', 'email', 'fees', 'funding_sources',
       'interpretation_services', 'keywords', 'languages', 'name',
       'required_documents', 'service_areas', 'status', 'wait_time', 'website',
       'taxonomy_ids'],
      dtype='object')

In [25]:
df[['id', 'location_id', 'program_id']] # for choosing specific cloumns

    id  location_id  program_id
0    1            1         NaN
1    2            2         NaN
2    3            3         NaN
3    4            4         NaN
4    5            5         NaN
5    6            6         NaN
6    7            7         NaN
7    8            8         NaN
8    9            9         NaN
9   10           10         NaN
10  11           11         NaN
11  12           12         NaN
12  13           13         NaN
13  14           14         NaN
14  15           15         NaN
15  16           16         NaN
16  17           17         NaN
17  18           18         NaN
18  19           19         NaN
19  20           20         NaN
20  21           21         NaN
21  22           22         NaN
22  23           22         NaN

In [27]:
df[['id', 'location_id', 'program_id']][0::2] # for performing slicing operations

    id  location_id  program_id
0    1            1         NaN
2    3            3         NaN
4    5            5         NaN
6    7            7         NaN
8    9            9         NaN
10  11           11         NaN
12  13           13         NaN
14  15           15         NaN
16  17           17         NaN
18  19           19         NaN
20  21           21         NaN
22  23           22         NaN

In [28]:
#df=pd.read_excel(), df= pd.read_html  # same manupulations can be done for reading excel, url files.

In [29]:
#Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In [30]:
"Series and DataFrame"

'Series and DataFrame'

In [31]:
#Q7. Create a DataFrame using multiple Series. Explain with an example.

In [32]:
d={"series1": [1,2,3,4], "series2": ["Delhi","Noida", "Gurugram", "Ghazaibad"], "series3": ["HCl","TCS","Google","Fiserv"]}

In [37]:
import pandas as pd

In [38]:
pd.DataFrame(data=d)

   series1    series2 series3
0        1      Delhi     HCl
1        2      Noida     TCS
2        3   Gurugram  Google
3        4  Ghazaibad  Fiserv

In [39]:
type(pd.DataFrame(data=d))

pandas.core.frame.DataFrame

In [40]:
type(pd.Series(series1))

pandas.core.series.Series